package org.example;
/*Описание задания.

        1 уровень сложности: Найти среднее арифметическое положительных элементов массива.
        Найти сумму всех элементов в массиве, которые делятся на 3 и одновременно не делятся на 5.
        Найти в массиве наибольшую сумму подряд идущих элементов.*/
public class Main {
  public static void main(String[] args) {

    System.out.printf("Hello and welcome!");


    for (int i = 1; i <= 5; i++) {

      System.out.println("i = " + i);
    }
  }
}